
/*
Домашка:

1.  Ви прийшли в Макдональдз з трьома друзями.
    Всі вони хочуть зʼїсти гамбургер. Ви хочете зʼїсти гамбургер з картоплею.
    Реалізувати код, який буде перевіряти, що якщо всім вистачає гамбургерів і картоплі,
    то виводити текст "Ми поїли" в консоль. Якщо на всіх не вистачає їжі,
    то виводити в консоль текст "Ми йдемо в інше кафе"
    (Змінні типу інтеджер містять кількість продуктів в наявності у вигляді вхідних даних)

2.  Напишіть умовну конструкцію if, що перевіряє, чи знаходиться значення ціни товару між 1000 та 1900 включно.
    Результат виводити в консоль.

3.  Напишіть конструкцію if, щоб перевіряє, чи значення ціни товару не знаходиться між 1000 та 1900 включно.
    Реалізуйте два варіанти, один з оператором НЕ !, а інший без цього оператора.
    Результат виводити в консоль.

4.  За номером пори року вивести назву цієї пори року використовуючи оператор if-else-if
    Результат виводити в консоль.

5.  Задано 3 числа (a, b, c), які не рівні між собою.
    Визначити середнє мід цими трьома числами
    (не середнє арифметичне значення, а яке з трьох заданих чисел среднє за значенням) використовуючи оператор if-else.
    Використати вкладені оператори if
    Результат виводити в консоль.

6.  Задано номер дня тижня.
    За заданим номером вивести назву дня тижня використовуючи switch.
    Результат виводити в консоль.

7.  За допомогою switch реалізуйте обчислення виразу, передаючи у switch, як параметр, символ математичної операції.
    Математичні операції для обчислення: "+", "-", "*", "/".
    Результат виводити в консоль.

8.*  Використовуючи властивості рядків (тип string), та регулярний вираз (regular expression) видалити голосні букви зі слова.

9.*  Використовуючи оператор if реалізувати логіку переводу метрів в кілометри,
    так щоб в консоль виводився результат обчислень з правильним закінченням.
    Наприклад: 1000 метрів це 1 кілометр;  32 метри це 0,032 кілометра і т.д.

    Підказка(https://ukr-lifehacks.ed-era.com/rozdil-9/zvyazok_chislivnykiv)
*/
// 1 перше завдання

// Всі вони хочуть зʼїсти гамбургер. Ви хочете зʼїсти гамбургер з картоплею.
//     Реалізувати код, який буде перевіряти, що якщо всім вистачає гамбургерів і картоплі,
//     то виводити текст "Ми поїли" в консоль. Якщо на всіх не вистачає їжі,
//     то виводити в консоль текст "Ми йдемо в інше кафе"
//     (Змінні типу інтеджер містять кількість продуктів в наявності у вигляді вхідних даних)


let humburger = 4;
let fries = 1;
if (humburger >= 4 && fries >= 1) {
    console.log('ми поїли')
}
else {
    console.log('ми йдемо в інше кафе')
}

function checkProducts(humburger, fries) {
    if (humburger >= 4 && fries >= 1) {
        console.log('ми поїли')
    }
    else {
        console.log('ми йдемо в інше кафе')
    }
}
checkProducts(1,1)


// 2 друге завдання

// Напишіть умовну конструкцію if, що перевіряє, чи знаходиться значення ціни товару між 1000 та 1900 включно.
//     Результат виводити в консоль.

let value = 1600
if (value >= 1000 && value <= 1900) {
    console.log('число в потрібному діапазоні')
}
else {
    console.log('число не в потрібному діапазоні')
}

function checkDiapason(value) {
    if (value >= 1000 && value <= 1900) {
        console.log('число в потрібному діапазоні')
    }
    else {
        console.log('число не в потрібному діапазоні')
    }
}
checkDiapason(1000)

// 3 задача

// Напишіть конструкцію if, щоб перевіряє, чи значення ціни товару не знаходиться між 1000 та 1900 включно.
//     Реалізуйте два варіанти, один з оператором НЕ !, а інший без цього оператора.
//     Результат виводити в консоль.

value = 1900
if (value >= 1000 && value <= 1900) {
    console.log('ціна ' + value + ' знаходиться між 1000 та 1900')
}
else {
    console.log('ціна ' + value + ' не знаходиться між 1000 та 1900')
}

// 2 спосіб

value = 1900
if (!(value >= 1000 && value <= 1900)) {
    console.log(`ціна ${value} не знаходиться між 1000 та 1900`)
}
else {
    console.log(`ціна ${value} знаходиться між 1000 та 1900`)
}


function checkDiapason(value) {
    if (value >= 1000 && value <= 1900) {
    console.log('ціна ' + value + ' знаходиться між 1000 та 1900')
}
else {
    console.log('ціна ' + value + ' не знаходиться між 1000 та 1900')
}

}
checkDiapason(2100)


// 4 задача

// За номером пори року вивести назву цієї пори року використовуючи оператор if-else-if
//     Результат виводити в консоль.

value = 4
if (value === 1) {
    console.log('зима');
}
if (value === 2) {
    console.log('весна');
}
if (value === 3) {
    console.log('літо');
}
if (value === 4) {
    console.log('осінь');
}
else {
    console.log('error');
}

function checkTimeOfTheYear(value) {
    if (value === 1) {
        console.log('зима');
    }
    if (value === 2) {
        console.log('весна');
    }
    if (value === 3) {
        console.log('літо');
    }
    if (value === 4) {
        console.log('осінь');
    }
    else {
        console.log('error');
    }
    
}
checkTimeOfTheYear(4) 

//5 задача
// Задано 3 числа (a, b, c), які не рівні між собою.
//     Визначити середнє мід цими трьома числами
//     (не середнє арифметичне значення, а яке з трьох заданих чисел среднє за значенням) використовуючи оператор if-else.
//     Використати вкладені оператори if
//     Результат виводити в консоль.


let a = 5;
let b = 10;
let c = 16;
let middle;

if (a > b) {
    if (a < c) { middle = a }
    else {
        middle = c
    }
}
else {
    if (b < c) { middle = b }
    else {
        middle = c
    }
}
console.log(middle);


function checkMean(a,b,c) {
    if (a > b) {
        if (a < c) { middle = a }
        else {
            middle = c
        }
    }
    else {
        if (b < c) { middle = b }
        else {
            middle = c
        }
    }
    console.log(middle);
    
}
checkMean(5,19,13)

// 6 задача
// Задано номер дня тижня.
// За заданим номером вивести назву дня тижня використовуючи switch.
// Результат виводити в консоль.
let number = 8
switch (number) {
    case 1:
        console.log('понеділок');
        break
    case 2:
        console.log('вівторок');
        break
    case 3:
        console.log('середа');
        break
    case 4:
        console.log('четвер');
        break
    case 5:
        console.log('пятниця');
        break
    case 6:
        console.log('субота');
        break
    case 7:
        console.log('неділя');
        break
    default:
        break
}

function ChecknameDay(number) {
    switch (number) {
        case 1:
            console.log('понеділок');
            break
        case 2:
            console.log('вівторок');
            break
        case 3:
            console.log('середа');
            break
        case 4:
            console.log('четвер');
            break
        case 5:
            console.log('пятниця');
            break
        case 6:
            console.log('субота');
            break
        case 7:
            console.log('неділя');
            break
        default:
            break
    }
    
}
ChecknameDay(7)

// 7 задача
// За допомогою switch реалізуйте обчислення виразу, передаючи у switch, як параметр, символ математичної операції.
// Математичні операції для обчислення: "+", "-", "*", "/".
// Результат виводити в консоль.
let x = 5;
let y = 2;
let result;
let symbol = '+'
switch (symbol) {
    case '+':
        result = x + y
        break;
    case '-':
        result = x - y
        break;
    case '*':
        result = x * y
        break;
    case '/':
        result = x / y
        break;
    default:
        break;
}
console.log(`${x} ${symbol} ${y} = ${result}`);

function calc(x, y, symbol) {
    let result
    switch (symbol) {
        case '+':
            result = x + y
            break;
        case '-':
            result = x - y
            break;
        case '*':
            result = x * y
            break;
        case '/':
            result = x / y
            break;
        default:
            break;
    }
    console.log(`${x} ${symbol} ${y} = ${result}`);
}
calc(10,20,'+')

